; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v8 - type_1 ?v3 - type_2)
 	      (pred_2 ?v5 - object ?v3 - type_2)
	      (pred_3 ?v8 - type_1 ?v4 - type_3)
	      (pred_4 ?v8 - type_1 ?v5 - object ?v4 - type_3))

   (:action op_2
       :parameters  (?v8 - type_1 ?v2 ?v7 - type_2)
       :precondition (and  (pred_1 ?v8 ?v2))
       :effect (and  (pred_1 ?v8 ?v7)
		     (not (pred_1 ?v8 ?v2))))

   (:action op_1
       :parameters (?v8 - type_1 ?v6 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v1) (pred_1 ?v8 ?v1) (pred_3 ?v8 ?v4))
       :effect (and (pred_4 ?v8 ?v6 ?v4)
		    (not (pred_2 ?v6 ?v1)) 
		    (not (pred_3 ?v8 ?v4))))

   (:action op_3
       :parameters (?v8 - type_1 ?v6 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v6 ?v4) (pred_1 ?v8 ?v1))
       :effect (and (pred_2 ?v6 ?v1)
		    (pred_3 ?v8 ?v4)
		    (not (pred_4 ?v8 ?v6 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_07 - type_1
obj_09 obj_04 obj_05 obj_03 - type_3
obj_08 obj_11 obj_10 obj_01 - type_2
obj_12 obj_02 obj_06 - object)
(:init
(pred_1 obj_13 obj_10)
(pred_3 obj_13 obj_09)
(pred_3 obj_13 obj_04)
(pred_1 obj_07 obj_10)
(pred_3 obj_07 obj_05)
(pred_3 obj_07 obj_03)
(pred_2 obj_12 obj_10)
(pred_2 obj_02 obj_11)
(pred_2 obj_06 obj_01)
)
(:goal
(and
(pred_2 obj_12 obj_10)
(pred_2 obj_02 obj_10)
(pred_2 obj_06 obj_11)
)
)

(:constraints
  (always (not (pred_1 obj_13 obj_01)))
)
)

; plan
1. (op_2 obj_13 obj_10 obj_11)
   deleted: (pred_1 obj_13 obj_10)
   added: (pred_1 obj_13 obj_11)
   goals met: 1 of 3
2. (op_2 obj_07 obj_10 obj_01)
   deleted: (pred_1 obj_07 obj_10)
   added: (pred_1 obj_07 obj_01)
   goals met: 1 of 3
3. (op_1 obj_07 obj_06 obj_01 obj_03)
   deleted: (pred_2 obj_06 obj_01) (pred_3 obj_07 obj_03)
   added: (pred_4 obj_07 obj_06 obj_03)
   goals met: 1 of 3
4. (op_1 obj_13 obj_02 obj_11 obj_04)
   deleted: (pred_2 obj_02 obj_11) (pred_3 obj_13 obj_04)
   added: (pred_4 obj_13 obj_02 obj_04)
   goals met: 1 of 3
5. (op_2 obj_07 obj_01 obj_11)
   deleted: (pred_1 obj_07 obj_01)
   added: (pred_1 obj_07 obj_11)
   goals met: 1 of 3
6. (op_2 obj_13 obj_11 obj_10)
   deleted: (pred_1 obj_13 obj_11)
   added: (pred_1 obj_13 obj_10)
   goals met: 1 of 3
7. (op_3 obj_13 obj_02 obj_10 obj_04)
   deleted: (pred_4 obj_13 obj_02 obj_04)
   added: (pred_2 obj_02 obj_10) (pred_3 obj_13 obj_04)
   goals met: 2 of 3
8. (op_3 obj_07 obj_06 obj_11 obj_03)
   deleted: (pred_4 obj_07 obj_06 obj_03)
   added: (pred_2 obj_06 obj_11) (pred_3 obj_07 obj_03)
   goals met: 3 of 3
